000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыПрограммЛояльности/КлючевыеАтрибутыПрограммЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеАтрибутыПрограммЛояльности</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйПроцентОплатыБонусами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьБаллыНаАкционныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьБаллыПоКредитнойПрограмме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>СовместноеНачислениеСкидокИБонусов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособПримененияСкидки</name>
    <type>
      <types>EnumRef.СпособыПримененияСкидокНаценок</types>
    </type>
  </resources>
  <resources>
    <name>ТипБонусов</name>
    <type>
      <types>EnumRef.ТипыБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипПрограммыЛояльности</name>
    <type>
      <types>EnumRef.ТипыПрограммЛояльности</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПрограммыЛояльности/ПрограммыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммыЛояльности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентОплатыБонусами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьБаллыНаАкционныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьБаллыПоКредитнойПрограмме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СовместноеНачислениеСкидокИБонусов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияСкидки</name>
    <type>
      <types>EnumRef.СпособыПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБонусов</name>
    <type>
      <types>EnumRef.ТипыБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммыЛояльности</name>
    <type>
      <types>EnumRef.ТипыПрограммЛояльности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураПредоставления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыИспользования</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыПрограммЛояльности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ФиксироватьИзменениеПриЗаписи(ПрограммаЛояльности, Отказ)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК ПрограммаЛояльности,
	|	ТаблицаВедущая.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|	ТаблицаВедущая.КоличествоПериодовОтсрочкиНачалаДействия КАК КоличествоПериодовОтсрочкиНачалаДействия,
	|	ТаблицаВедущая.МаксимальныйПроцентОплатыБонусами КАК МаксимальныйПроцентОплатыБонусами,
	|	ТаблицаВедущая.НачислятьБаллыНаАкционныйТовар КАК НачислятьБаллыНаАкционныйТовар,
	|	ТаблицаВедущая.НачислятьБаллыПоКредитнойПрограмме КАК НачислятьБаллыПоКредитнойПрограмме,
	|	ТаблицаВедущая.ПериодДействия КАК ПериодДействия,
	|	ТаблицаВедущая.ПериодОтсрочкиНачалаДействия КАК ПериодОтсрочкиНачалаДействия,
	|	ТаблицаВедущая.СовместноеНачислениеСкидокИБонусов КАК СовместноеНачислениеСкидокИБонусов,
	|	ТаблицаВедущая.СпособПримененияСкидки КАК СпособПримененияСкидки,
	|	ТаблицаВедущая.ТипБонусов КАК ТипБонусов,
	|	ТаблицаВедущая.ТипПрограммыЛояльности КАК ТипПрограммыЛояльности
	|ИЗ
	|	Справочник.ПрограммыЛояльности КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеАтрибутыПрограммЛояльности.СрезПоследних(, ПрограммаЛояльности = &ПрограммаЛояльности) КАК ТаблицаРегистра
	|		ПО ТаблицаВедущая.Ссылка = ТаблицаРегистра.ПрограммаЛояльности
	|			И ТаблицаВедущая.КоличествоПериодовДействия = ТаблицаРегистра.КоличествоПериодовДействия
	|			И ТаблицаВедущая.КоличествоПериодовОтсрочкиНачалаДействия = ТаблицаРегистра.КоличествоПериодовОтсрочкиНачалаДействия
	|			И ТаблицаВедущая.МаксимальныйПроцентОплатыБонусами = ТаблицаРегистра.МаксимальныйПроцентОплатыБонусами
	|			И ТаблицаВедущая.НачислятьБаллыНаАкционныйТовар = ТаблицаРегистра.НачислятьБаллыНаАкционныйТовар
	|			И ТаблицаВедущая.НачислятьБаллыПоКредитнойПрограмме = ТаблицаРегистра.НачислятьБаллыПоКредитнойПрограмме
	|			И ТаблицаВедущая.ПериодДействия = ТаблицаРегистра.ПериодДействия
	|			И ТаблицаВедущая.ПериодОтсрочкиНачалаДействия = ТаблицаРегистра.ПериодОтсрочкиНачалаДействия
	|			И ТаблицаВедущая.СовместноеНачислениеСкидокИБонусов = ТаблицаРегистра.СовместноеНачислениеСкидокИБонусов
	|			И ТаблицаВедущая.СпособПримененияСкидки = ТаблицаРегистра.СпособПримененияСкидки
	|			И ТаблицаВедущая.ТипБонусов = ТаблицаРегистра.ТипБонусов
	|			И ТаблицаВедущая.ТипПрограммыЛояльности = ТаблицаРегистра.ТипПрограммыЛояльности
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &ПрограммаЛояльности
	|	И ТаблицаРегистра.ПрограммаЛояльности ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ПрограммаЛояльности КАК ПрограммаЛояльности
	|ИЗ
	|	РегистрСведений.КлючевыеАтрибутыПрограммЛояльности.СрезПоследних(, ПрограммаЛояльности = &ПрограммаЛояльности) КАК ТаблицаРегистра"
	);
	Запрос.УстановитьПараметр("ПрограммаЛояльности", ПрограммаЛояльности);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если НЕ РезультатыЗапроса[0].Пустой() Тогда

		Выборка = РезультатыЗапроса[0].Выбрать();
		Выборка.Следующий();

		НаборЗаписей = РегистрыСведений.КлючевыеАтрибутыПрограммЛояльности.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		НаборЗаписей.Отбор.Период.Установить(?(РезультатыЗапроса[1].Пустой(), '20160101', ТекущаяДатаСеанса()));
		НаборЗаписей.Отбор.ПрограммаЛояльности.Установить(ПрограммаЛояльности);

		ЗаписьНабора = НаборЗаписей.Добавить();

		ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);

		ЗаписьНабора.Период = НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.ПрограммаЛояльности = НаборЗаписей.Отбор.ПрограммаЛояльности.Значение;
		ЗаписьНабора.Автор = ПараметрыСеанса.ТекущийПользователь;

		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
